cf/InformationRegisters/IndividualsDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>IndividualsDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WhoIssued</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DepartmentCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IndividualsDocumentsKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/IndividualsDocuments/Forms/FormFillingDetails/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillRecord();
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	Notify("ChangedIndividualDocument");
	
EndProcedure

#EndRegion

#Region FormItemsEventHadlers

&AtClient
Procedure DocumentKindOnChange(Item)
	
	If IsIdentityDocument(Record.Ind, Record.DocumentKind, Record.Period) Then
		Record.IsIdentityDocument = True;
	EndIf;
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure FillRecord()
	
	QueryIndividualDocuments = New Query;
	QueryIndividualDocuments.Text =
	"SELECT TOP 1
	|	IndividualsDocumentsSliceLast.Period,
	|	IndividualsDocumentsSliceLast.Ind,
	|	IndividualsDocumentsSliceLast.DocumentKind,
	|	IndividualsDocumentsSliceLast.Series,
	|	IndividualsDocumentsSliceLast.Number,
	|	IndividualsDocumentsSliceLast.IssueDate,
	|	IndividualsDocumentsSliceLast.ValidityPeriod,
	|	IndividualsDocumentsSliceLast.WhoIssued,
	|	IndividualsDocumentsSliceLast.DepartmentCode,
	|	IndividualsDocumentsSliceLast.IsIdentityDocument,
	|	IndividualsDocumentsSliceLast.Presentation,
	|	1 AS Priority
	|FROM
	|	InformationRegister.IndividualsDocuments.SliceLast(
	|			,
	|			Ind = &Ind
	|				AND DocumentKind = &DocumentKind) AS IndividualsDocumentsSliceLast
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	IndividualsDocumentsSliceLast.Period,
	|	IndividualsDocumentsSliceLast.Ind,
	|	IndividualsDocumentsSliceLast.DocumentKind,
	|	IndividualsDocumentsSliceLast.Series,
	|	IndividualsDocumentsSliceLast.Number,
	|	IndividualsDocumentsSliceLast.IssueDate,
	|	IndividualsDocumentsSliceLast.ValidityPeriod,
	|	IndividualsDocumentsSliceLast.WhoIssued,
	|	IndividualsDocumentsSliceLast.DepartmentCode,
	|	IndividualsDocumentsSliceLast.IsIdentityDocument,
	|	IndividualsDocumentsSliceLast.Presentation,
	|	2
	|FROM
	|	InformationRegister.IndividualsDocuments.SliceLast(, Ind = &Ind) AS IndividualsDocumentsSliceLast
	|
	|ORDER BY
	|	Priority";
	QueryIndividualDocuments.SetParameter("Ind", Parameters.Ind);
	QueryIndividualDocuments.SetParameter("DocumentKind", Catalogs.IndividualsDocumentsKinds.LocalPassport);
	Selection = QueryIndividualDocuments.Execute().Select();
	If Selection.Next() Then
		Manager = InformationRegisters.IndividualsDocuments.CreateRecordManager();
		FillPropertyValues(Manager, Selection);
		Manager.Read();
		If Manager.Selected() Then
			ValueToFormAttribute(Manager, "Record");
		Else
			FillPropertyValues(Record, Selection);
		EndIf;
	Else
		Record.Ind					= Parameters.Ind;
		Record.Period				= Date('20000101');
		Record.IsIdentityDocument	= True;
		Record.DocumentKind			= Catalogs.IndividualsDocumentsKinds.LocalPassport;
	EndIf;
	
EndProcedure

&AtServerNoContext
Function IsIdentityDocument(Individual, DocumentKind, Date)
	
	Return InformationRegisters.IndividualsDocuments.IsPersonID(Individual, DocumentKind, Date);
	
EndFunction

#EndRegion
